xtee55/mediator-common-test/src/main/resources/v5xroad-simple4.request

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <xrd:consumer xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">consumer</xrd:consumer>
        <xrd:producer xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">producer</xrd:producer>
        <xrd:userId xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">EE37702211234</xrd:userId>
        <xrd:service xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">producer.testQuery.v1</xrd:service>
        <xrd:id xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">1234567890</xrd:id>
        <xrd:unit xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">unit</xrd:unit>        
        <xrd:position xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">position</xrd:position>
        <xrd:userName xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">userName</xrd:userName>
        <xrd:async xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">true</xrd:async>
        <xrd:paid xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">paid</xrd:paid>
        <xrd:issue xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">issue</xrd:issue>
        <xrd:encrypt xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">encrypt</xrd:encrypt>
        <xrd:encrypted xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">encrypted</xrd:encrypted>
        <xrd:foobar xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">baz</xrd:foobar>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:testQuery xmlns:ns1="http://cosumer.ee.xroad.net">
            <request>
                <name>foo</name>
                <age>35</age>
            </request>
        </ns1:testQuery>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
